----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/stanza/Downloads/Assignment.log
  log type:  text
 opened on:  30 May 2018, 03:24:08

. //cd \\ad.monash.edu\home\User079\szha0076\Desktop\ETC4420
. use "PHI.dta", replace

. set seed 27886913

. sample 22000, count
(3,089 observations deleted)

. 
. *********************************************************
. ******************First question*************************
. *********************************************************
. 
. //check data summary statistics
. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    cobcodcb |     22,000    1.339227    .6805015          1          3
         sex |     22,000    1.533682    .4988756          1          2
       agecb |     22,000    8.473864    4.461191          1         18
    mainlanc |     22,000    .8296818    .4954825          0          2
    edattq1c |     22,000    2.239273    2.096543          0          9
-------------+---------------------------------------------------------
    edattqcb |     22,000    3.451636    2.020268          0          7
    edattpcb |     22,000    3.160727    2.290563          0          9
    oralq4cb |     22,000    .0709091    .2908816          0          2
    dntprofc |     22,000    4.416455    1.686676          1          9
     docq2cb |     22,000    .2495909    .5389715          0          3
-------------+---------------------------------------------------------
     docq4cb |     22,000       .0645      .27827          0          2
    dcclstim |     22,000    2.734955    1.450198          1          9
    healinq1 |     22,000    1.265682    .8522381          0          9
     tphimem |     22,000       2.985    2.081077          0          9
    hicvrtyp |     22,000    3.166318    1.891344          0          9
-------------+---------------------------------------------------------
    al2k7day |     22,000    2.041955    1.997638          0          9
    exmodnoc |     22,000     52.5765    46.35945          0         99
    exvignoc |     22,000    68.52464    42.83222          0         96
      extype |     22,000    2.421182    2.224822          0          8
     exlevel |     22,000    2.736955    1.727949          0          8
-------------+---------------------------------------------------------
     bdymsq1 |     22,000    1.430273    1.073444          0          3
    bmweigcb |     22,000    126.2919    240.9421          0        999
    bmheighc |     22,000     158.955    142.6572          0        999
    bmbmicat |     22,000    12.27936     26.0175          0         99
    smkreglr |     22,000    2.362682    1.633594          0          4
-------------+---------------------------------------------------------
    smstatuc |     22,000    2.332273    1.611996          0          4
      sf12q2 |     22,000    2.040727    1.361906          0          5
      ltcond |     22,000    1.200545    .4004176          1          2
     condnoc |     22,000    2.398136     1.83859          0          5
      sighq2 |     22,000    1.485273    .4997944          1          2
-------------+---------------------------------------------------------
         sms |     22,000    1.711409    1.187399          0          3
    incdecpn |     22,000    26.64045    39.31263          0         99
    empstabc |     22,000    1.963682    1.507922          0          4

. tab hicvrtyp //tabulation of the dependent variable for 1st question

 Type of private health insurance cover |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                         Not applicable |      3,771       17.14       17.14
                    Hospital cover only |      1,458        6.63       23.77
                   Ancillary cover only |        688        3.13       26.90
      Both hospital and ancillary cover |      6,901       31.37       58.26
    Insured but type of cover not known |         84        0.38       58.65
       Without private health insurance |      9,024       41.02       99.66
Not known if has private health insuran |         74        0.34      100.00
----------------------------------------+-----------------------------------
                                  Total |     22,000      100.00

. gen phi=0 if hicvrtyp==5 //without phi
(12,976 missing values generated)

. replace phi=1 if hicvrtyp==1 //Hospital cover only 
(1,458 real changes made)

. replace phi=2 if hicvrtyp==2 //Ancillary cover only
(688 real changes made)

. replace phi=3 if hicvrtyp==3  //Both hospital and ancillary cover
(6,901 real changes made)

. //We can see clear correlation between age and dental visits.
. tab agecb

 Age of person in |
            years |      Freq.     Percent        Cum.
------------------+-----------------------------------
        0-4 years |        895        4.07        4.07
        5-9 years |      1,317        5.99       10.05
      10-14 years |      1,559        7.09       17.14
      15-19 years |      1,549        7.04       24.18
      20-24 years |      1,163        5.29       29.47
      25-29 years |      1,290        5.86       35.33
      30-34 years |      1,663        7.56       42.89
      35-39 years |      1,753        7.97       50.86
      40-44 years |      1,772        8.05       58.91
      45-49 years |      1,628        7.40       66.31
      50-54 years |      1,449        6.59       72.90
      55-59 years |      1,412        6.42       79.32
      60-64 years |      1,186        5.39       84.71
      65-69 years |        926        4.21       88.92
      70-74 years |        867        3.94       92.86
      75-79 years |        727        3.30       96.16
      80-84 years |        519        2.36       98.52
85 years and over |        325        1.48      100.00
------------------+-----------------------------------
            Total |     22,000      100.00

. //too many band, age group with simlar distribution will be grouped into broader
. //age band. common sense of relationship between age and dental condition is 
. //also consistent with this re-group
. tab agecb oralq4cb, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |    Number of times consulted
 Age of person in |  dentist or dental professional
            years | Not appli          1  2 or more |     Total
------------------+---------------------------------+----------
        0-4 years |       871         24          0 |       895 
                  |     97.32       2.68       0.00 |    100.00 
------------------+---------------------------------+----------
        5-9 years |     1,208         97         12 |     1,317 
                  |     91.72       7.37       0.91 |    100.00 
------------------+---------------------------------+----------
      10-14 years |     1,396        145         18 |     1,559 
                  |     89.54       9.30       1.15 |    100.00 
------------------+---------------------------------+----------
      15-19 years |     1,435        101         13 |     1,549 
                  |     92.64       6.52       0.84 |    100.00 
------------------+---------------------------------+----------
      20-24 years |     1,103         53          7 |     1,163 
                  |     94.84       4.56       0.60 |    100.00 
------------------+---------------------------------+----------
      25-29 years |     1,230         49         11 |     1,290 
                  |     95.35       3.80       0.85 |    100.00 
------------------+---------------------------------+----------
      30-34 years |     1,583         71          9 |     1,663 
                  |     95.19       4.27       0.54 |    100.00 
------------------+---------------------------------+----------
      35-39 years |     1,672         68         13 |     1,753 
                  |     95.38       3.88       0.74 |    100.00 
------------------+---------------------------------+----------
      40-44 years |     1,661         90         21 |     1,772 
                  |     93.74       5.08       1.19 |    100.00 
------------------+---------------------------------+----------
      45-49 years |     1,538         70         20 |     1,628 
                  |     94.47       4.30       1.23 |    100.00 
------------------+---------------------------------+----------
      50-54 years |     1,362         74         13 |     1,449 
                  |     94.00       5.11       0.90 |    100.00 
------------------+---------------------------------+----------
      55-59 years |     1,317         76         19 |     1,412 
                  |     93.27       5.38       1.35 |    100.00 
------------------+---------------------------------+----------
      60-64 years |     1,096         69         21 |     1,186 
                  |     92.41       5.82       1.77 |    100.00 
------------------+---------------------------------+----------
      65-69 years |       869         47         10 |       926 
                  |     93.84       5.08       1.08 |    100.00 
------------------+---------------------------------+----------
      70-74 years |       814         46          7 |       867 
                  |     93.89       5.31       0.81 |    100.00 
------------------+---------------------------------+----------
      75-79 years |       681         39          7 |       727 
                  |     93.67       5.36       0.96 |    100.00 
------------------+---------------------------------+----------
      80-84 years |       499         18          2 |       519 
                  |     96.15       3.47       0.39 |    100.00 
------------------+---------------------------------+----------
85 years and over |       311         11          3 |       325 
                  |     95.69       3.38       0.92 |    100.00 
------------------+---------------------------------+----------
            Total |    20,646      1,148        206 |    22,000 
                  |     93.85       5.22       0.94 |    100.00 


. gen age14=0 //(not applicable 1st question)

. gen age1519=0  //(ref.level 1st question)

. gen age2039=0

. gen age4064=0

. gen age6579=0

. gen age80=0

. replace age14=1 if agecb==1
(895 real changes made)

. replace age14=1 if agecb==2
(1,317 real changes made)

. replace age14=1 if agecb==3
(1,559 real changes made)

. replace age1519=1 if agecb==4
(1,549 real changes made)

. replace age2039=1 if agecb==5
(1,163 real changes made)

. replace age2039=1 if agecb==6
(1,290 real changes made)

. replace age2039=1 if agecb==7
(1,663 real changes made)

. replace age2039=1 if agecb==8
(1,753 real changes made)

. replace age4064=1 if agecb==9
(1,772 real changes made)

. replace age4064=1 if agecb==10
(1,628 real changes made)

. replace age4064=1 if agecb==11
(1,449 real changes made)

. replace age4064=1 if agecb==12
(1,412 real changes made)

. replace age4064=1 if agecb==13
(1,186 real changes made)

. replace age6579=1 if agecb==14
(926 real changes made)

. replace age6579=1 if agecb==15
(867 real changes made)

. replace age6579=1 if agecb==16
(727 real changes made)

. replace age80=1 if agecb==17
(519 real changes made)

. replace age80=1 if agecb==18
(325 real changes made)

. //cross tab indicates age group below 14 is not applicable in the first question
. tab agecb hicvrtyp

 Age of person in |         Type of private health insurance cover
            years | Not appli  Hospital   Ancillary  Both hosp  Insured b |     Total
------------------+-------------------------------------------------------+----------
        0-4 years |       895          0          0          0          0 |       895 
        5-9 years |     1,317          0          0          0          0 |     1,317 
      10-14 years |     1,559          0          0          0          0 |     1,559 
      15-19 years |         0         91         67        601         19 |     1,549 
      20-24 years |         0         50         39        304         18 |     1,163 
      25-29 years |         0         45         61        361          5 |     1,290 
      30-34 years |         0         86         59        589          4 |     1,663 
      35-39 years |         0        124         72        667          6 |     1,753 
      40-44 years |         0        138         73        741          6 |     1,772 
      45-49 years |         0        136         79        689          4 |     1,628 
      50-54 years |         0        127         60        712          1 |     1,449 
      55-59 years |         0        138         56        677          2 |     1,412 
      60-64 years |         0        121         45        514          9 |     1,186 
      65-69 years |         0         97         26        359          1 |       926 
      70-74 years |         0         90         31        290          1 |       867 
      75-79 years |         0        101         16        192          3 |       727 
      80-84 years |         0         82          3        128          3 |       519 
85 years and over |         0         32          1         77          2 |       325 
------------------+-------------------------------------------------------+----------
            Total |     3,771      1,458        688      6,901         84 |    22,000 


                  |    Type of private
                  |   health insurance
 Age of person in |         cover
            years | Without p  Not known |     Total
------------------+----------------------+----------
        0-4 years |         0          0 |       895 
        5-9 years |         0          0 |     1,317 
      10-14 years |         0          0 |     1,559 
      15-19 years |       741         30 |     1,549 
      20-24 years |       742         10 |     1,163 
      25-29 years |       813          5 |     1,290 
      30-34 years |       921          4 |     1,663 
      35-39 years |       880          4 |     1,753 
      40-44 years |       813          1 |     1,772 
      45-49 years |       716          4 |     1,628 
      50-54 years |       547          2 |     1,449 
      55-59 years |       537          2 |     1,412 
      60-64 years |       494          3 |     1,186 
      65-69 years |       440          3 |       926 
      70-74 years |       454          1 |       867 
      75-79 years |       414          1 |       727 
      80-84 years |       301          2 |       519 
85 years and over |       211          2 |       325 
------------------+----------------------+----------
            Total |     9,024         74 |    22,000 


. //dummy for gender
. tab sex

     Sex of |
     person |      Freq.     Percent        Cum.
------------+-----------------------------------
       Male |     10,259       46.63       46.63
     Female |     11,741       53.37      100.00
------------+-----------------------------------
      Total |     22,000      100.00

. gen male=0

. replace male=1 if sex==1
(10,259 real changes made)

. //dummy for marital status
. tab sms

           Social Marital Status |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                  Not applicable |      3,771       17.14       17.14
Married in a registered marriage |      8,286       37.66       54.80
   Married in a defacto marriage |        464        2.11       56.91
                     Not married |      9,479       43.09      100.00
---------------------------------+-----------------------------------
                           Total |     22,000      100.00

. gen married=1 if sms==1 //married registered
(13,714 missing values generated)

. replace married=1 if sms==2 //married de facto
(464 real changes made)

. replace married=0 if sms==3 //not married (ref.level)
(9,479 real changes made)

. //dummy for work status
. tab empstabc 

Full-time/part-time labour force status |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                         Not applicable |      3,771       17.14       17.14
            Employed, working full-time |      7,333       33.33       50.47
            Employed, working part-time |      3,599       16.36       66.83
Unemployed, looking for full-time or pa |        518        2.35       69.19
                Not in the labour force |      6,779       30.81      100.00
----------------------------------------+-----------------------------------
                                  Total |     22,000      100.00

. gen workft=0 

. gen workpt=0

. gen unemp=0

. gen nlf=0  //(ref.level)

. replace workft=1 if empstabc==1 //work full time
(7,333 real changes made)

. replace workpt=1 if empstabc==2 //work part time
(3,599 real changes made)

. replace unemp=1 if empstabc==3  //unemployed
(518 real changes made)

. replace nlf=1 if empstabc==4 //not in labour force
(6,779 real changes made)

. //dummy for long-term condition
. tab ltcond

    Whether has long term condition |      Freq.     Percent        Cum.
------------------------------------+-----------------------------------
          Has a long term condition |     17,588       79.95       79.95
Does not have a long term condition |      4,412       20.05      100.00
------------------------------------+-----------------------------------
                              Total |     22,000      100.00

. gen longtc=0

. replace longtc=1 if ltcond==1 //has long-term condition
(17,588 real changes made)

. //dummy for general health assessment
. tab sf12q2

General health |
    assessment |      Freq.     Percent        Cum.
---------------+-----------------------------------
Not applicable |      3,771       17.14       17.14
     Excellent |      3,742       17.01       34.15
     Very good |      6,323       28.74       62.89
          Good |      5,049       22.95       85.84
          Fair |      2,214       10.06       95.90
          Poor |        901        4.10      100.00
---------------+-----------------------------------
         Total |     22,000      100.00

. gen excelh=0 

. gen verygood=0

. gen good=0

. gen fair=0

. gen poor=0 //(ref.level)

. replace excelh=1 if sf12q2==1
(3,742 real changes made)

. replace verygood=1 if sf12q2==2
(6,323 real changes made)

. replace good=1 if sf12q2==3
(5,049 real changes made)

. replace fair=1 if sf12q2==4
(2,214 real changes made)

. replace poor=1 if sf12q2==5  
(901 real changes made)

. //dummy for educational attainment 
. tab edattqcb

            Level of highest non-school |
                          qualification |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                         Not applicable |      3,771       17.14       17.14
Postgraduate Degree, Graduate Diploma / |        931        4.23       21.37
                        Bachelor Degree |      2,145        9.75       31.12
             Advanced Diploma / Diploma |      1,461        6.64       37.76
                            Certificate |      4,212       19.15       56.91
            No non-school qualification |      8,354       37.97       94.88
                   Level not determined |        168        0.76       95.65
            Not asked (still at school) |        958        4.35      100.00
----------------------------------------+-----------------------------------
                                  Total |     22,000      100.00

. gen degree=0

. gen dipcert=0

. gen less12yr=0 //(ref.level)

. replace degree=1 if edattqcb==1
(931 real changes made)

. replace degree=1 if edattqcb==2
(2,145 real changes made)

. replace dipcert=1 if edattqcb==3
(1,461 real changes made)

. replace dipcert=1 if edattqcb==4
(4,212 real changes made)

. replace less12yr=1 if edattqcb==5
(8,354 real changes made)

. //generate dummy variable for language spoken at home
. gen English=0

. gen Australia=0

. gen nonEng=0 //(ref.level)

. replace English=1 if cobcodcb==2
(2,207 real changes made)

. replace Australia=1 if cobcodcb==1
(17,165 real changes made)

. replace nonEng=0 if cobcodcb==3
(0 real changes made)

. //generate dummy variable for income group
. tab incdecpn

  Gross weekly |
      personal |
     income in |
       deciles |      Freq.     Percent        Cum.
---------------+-----------------------------------
Not applicable |      1,036        4.71        4.71
  First decile |      1,421        6.46       11.17
 Second decile |      1,377        6.26       17.43
  Third decile |      2,099        9.54       26.97
 Fourth decile |      1,754        7.97       34.94
  Fifth decile |      1,637        7.44       42.38
  Sixth decile |      1,496        6.80       49.18
Seventh decile |      1,259        5.72       54.90
 Eighth decile |      1,512        6.87       61.78
  Ninth decile |      1,830        8.32       70.10
  Tenth decile |      1,496        6.80       76.90
    Not stated |      4,115       18.70       95.60
     Not known |        968        4.40      100.00
---------------+-----------------------------------
         Total |     22,000      100.00

. gen income3=0  //(ref.level)

. gen income4=0

. gen income5=0

. gen income6=0

. gen income7=0

. gen income8=0

. gen income9=0

. gen income10=0

. replace income3=1 if incdecpn==3
(2,099 real changes made)

. replace income4=1 if incdecpn==4
(1,754 real changes made)

. replace income5=1 if incdecpn==5
(1,637 real changes made)

. replace income6=1 if incdecpn==6
(1,496 real changes made)

. replace income7=1 if incdecpn==7
(1,259 real changes made)

. replace income8=1 if incdecpn==8
(1,512 real changes made)

. replace income9=1 if incdecpn==9
(1,830 real changes made)

. replace income10=1 if incdecpn==10
(1,496 real changes made)

. //MNL model regression
. mlogit phi age2039 age4064 age6579 age80 Australia /*
> */English male married condno excelh verygood good fair degree dipcert /*
> */income4 income5 income6 income7 income8 income9 income10 workft workpt unemp

Iteration 0:   log likelihood = -18828.359  
Iteration 1:   log likelihood = -17118.978  
Iteration 2:   log likelihood = -17096.888  
Iteration 3:   log likelihood =  -17096.46  
Iteration 4:   log likelihood = -17096.457  
Iteration 5:   log likelihood = -17096.457  

Multinomial logistic regression                 Number of obs     =     18,071
                                                LR chi2(75)       =    3463.80
                                                Prob > chi2       =     0.0000
Log likelihood = -17096.457                     Pseudo R2         =     0.0920

------------------------------------------------------------------------------
         phi |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
0            |  (base outcome)
-------------+----------------------------------------------------------------
1            |
     age2039 |  -1.104513   .1455873    -7.59   0.000    -1.389859    -.819167
     age4064 |  -.1881573   .1425494    -1.32   0.187     -.467549    .0912343
     age6579 |   .3213657   .1546799     2.08   0.038     .0181986    .6245328
       age80 |    .510495   .1748393     2.92   0.004     .1678162    .8531738
   Australia |   .1548342   .0829319     1.87   0.062    -.0077094    .3173778
     English |  -.2027427   .1154373    -1.76   0.079    -.4289955    .0235102
        male |  -.3035661   .0637682    -4.76   0.000    -.4285493   -.1785828
     married |    .683721   .0625064    10.94   0.000     .5612108    .8062312
     condnoc |   .0506212   .0208122     2.43   0.015       .00983    .0914125
      excelh |   1.097574    .166187     6.60   0.000     .7718531    1.423294
    verygood |   .8493872    .158285     5.37   0.000     .5391542     1.15962
        good |   .6408188   .1570679     4.08   0.000     .3329713    .9486663
        fair |   .3752419   .1665415     2.25   0.024     .0488266    .7016572
      degree |   .7763172   .0865306     8.97   0.000     .6067203    .9459141
     dipcert |   .0387897   .0706611     0.55   0.583    -.0997035    .1772829
     income4 |  -.1126856   .1040201    -1.08   0.279    -.3165612    .0911901
     income5 |  -.0889556   .1160025    -0.77   0.443    -.3163164    .1384051
     income6 |   .0095571   .1249333     0.08   0.939    -.2353076    .2544218
     income7 |   .0429327   .1390515     0.31   0.758    -.2296032    .3154685
     income8 |   .2730354   .1321418     2.07   0.039     .0140423    .5320285
     income9 |   .6608884   .1246231     5.30   0.000     .4166316    .9051452
    income10 |   1.277368   .1386461     9.21   0.000     1.005626    1.549109
      workft |    .247505   .1049274     2.36   0.018     .0418511    .4531589
      workpt |   .2460956   .0967252     2.54   0.011     .0565177    .4356734
       unemp |  -.9497168   .2826128    -3.36   0.001    -1.503628   -.3958059
       _cons |  -3.062332   .2115534   -14.48   0.000    -3.476969   -2.647695
-------------+----------------------------------------------------------------
2            |
     age2039 |  -.9525468   .1707415    -5.58   0.000    -1.287194   -.6178996
     age4064 |  -.6196691   .1735109    -3.57   0.000    -.9597443   -.2795939
     age6579 |   -.819051   .2103943    -3.89   0.000    -1.231416   -.4066857
       age80 |  -2.647196   .5307811    -4.99   0.000    -3.687508   -1.606884
   Australia |   .0148171   .1172186     0.13   0.899    -.2149271    .2445614
     English |   .2547374   .1485088     1.72   0.086    -.0363344    .5458092
        male |  -.3474622   .0879444    -3.95   0.000    -.5198301   -.1750943
     married |   .5507432    .086506     6.37   0.000     .3811946    .7202918
     condnoc |   .0861665   .0276023     3.12   0.002      .032067     .140266
      excelh |   .8890581   .2625454     3.39   0.001     .3744786    1.403638
    verygood |   .7600286   .2528756     3.01   0.003     .2644015    1.255656
        good |   .7716416   .2502547     3.08   0.002     .2811514    1.262132
        fair |   .6048501   .2613579     2.31   0.021      .092598    1.117102
      degree |   .3336533   .1294432     2.58   0.010     .0799493    .5873572
     dipcert |   .1933574   .0921271     2.10   0.036     .0127916    .3739233
     income4 |  -.2329451   .1566836    -1.49   0.137    -.5400394    .0741492
     income5 |   .1099582   .1461605     0.75   0.452    -.1765112    .3964275
     income6 |    .049633   .1589259     0.31   0.755     -.261856    .3611219
     income7 |   .2736573   .1648889     1.66   0.097     -.049519    .5968337
     income8 |   .1691338   .1734083     0.98   0.329    -.1707403    .5090079
     income9 |   .3009983   .1735757     1.73   0.083    -.0392038    .6412004
    income10 |   .3290499   .2237544     1.47   0.141    -.1095006    .7676004
      workft |   .4675598   .1380885     3.39   0.001     .1969114    .7382083
      workpt |   .4361228   .1263473     3.45   0.001     .1884867     .683759
       unemp |   -.112493    .253374    -0.44   0.657    -.6090969     .384111
       _cons |  -3.372857   .3060237   -11.02   0.000    -3.972652   -2.773061
-------------+----------------------------------------------------------------
3            |
     age2039 |  -1.489873   .0768665   -19.38   0.000    -1.640529   -1.339218
     age4064 |  -.8204134   .0771297   -10.64   0.000    -.9715848    -.669242
     age6579 |  -.6303355   .0886876    -7.11   0.000    -.8041599    -.456511
       age80 |     -.8926   .1138704    -7.84   0.000    -1.115782   -.6694181
   Australia |   .4481027   .0538926     8.31   0.000     .3424751    .5537303
     English |   .1509461   .0715942     2.11   0.035     .0106241     .291268
        male |  -.3089245   .0383946    -8.05   0.000    -.3841764   -.2336725
     married |    .779685   .0377811    20.64   0.000     .7056354    .8537346
     condnoc |   .1070485   .0123962     8.64   0.000     .0827525    .1313445
      excelh |   1.053571    .100029    10.53   0.000      .857518    1.249624
    verygood |   .8399473    .094967     8.84   0.000     .6538153    1.026079
        good |    .607933    .094216     6.45   0.000     .4232729     .792593
        fair |   .2348782   .1007697     2.33   0.020     .0373731    .4323832
      degree |   .8737783    .054793    15.95   0.000     .7663859    .9811706
     dipcert |   .1650932   .0414778     3.98   0.000     .0837982    .2463882
     income4 |   -.238857   .0659423    -3.62   0.000    -.3681015   -.1096125
     income5 |    .056406   .0669884     0.84   0.400    -.0748889    .1877009
     income6 |   .0532611   .0730948     0.73   0.466    -.0900022    .1965243
     income7 |   .1515072   .0797922     1.90   0.058    -.0048826     .307897
     income8 |    .553287   .0763805     7.24   0.000      .403584    .7029901
     income9 |   .9300629   .0756497    12.29   0.000     .7817922    1.078334
    income10 |   1.669076   .0900804    18.53   0.000     1.492521     1.84563
      workft |   .3941062   .0620773     6.35   0.000     .2724369    .5157755
      workpt |   .4628413    .056445     8.20   0.000      .352211    .5734715
       unemp |  -.5897365   .1287862    -4.58   0.000    -.8421529   -.3373201
       _cons |  -1.623629   .1234622   -13.15   0.000    -1.865611   -1.381648
------------------------------------------------------------------------------

. 
. quietly mlogit phi age2039 age4064 age6579 age80 Australia /*
> */English male married condno excelh verygood good fair degree dipcert /*
> */income4 income5 income6 income7 income8 income9 income10 workft workpt unemp

. predict pp0, outcome(0)
(option pr assumed; predicted probability)
(3,771 missing values generated)

. predict pp1, outcome(1)
(option pr assumed; predicted probability)
(3,771 missing values generated)

. predict pp2, outcome(2)
(option pr assumed; predicted probability)
(3,771 missing values generated)

. predict pp3, outcome(3)
(option pr assumed; predicted probability)
(3,771 missing values generated)

. sum pp0 pp1 pp2 pp3 //estimated probabilities

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         pp0 |     18,229    .4998842    .1968487   .0292955   .9532309
         pp1 |     18,229    .0805851    .0349134    .004534   .2732176
         pp2 |     18,229    .0380714    .0155849   .0016776   .1178813
         pp3 |     18,229    .3814593    .1760294   .0297977   .8589309

. 
. //hit and loss
. gen hatphi0=pp0>=pp1 & pp0>=pp2 & pp0>=pp3

. gen hatphi1=pp1>=pp0 & pp1>=pp2 & pp1>=pp3

. gen hatphi2=pp2>=pp0 & pp2>=pp1 & pp2>=pp3

. gen hatphi3=pp3>=pp0 & pp3>=pp1 & pp3>=pp2

. gen hatphi=0 

. replace hatphi=1 if hatphi1==1
(3,771 real changes made)

. replace hatphi=2 if hatphi2==1
(3,771 real changes made)

. replace hatphi=3 if hatphi3==1
(10,332 real changes made)

. tab phi hatphi

           |        hatphi
       phi |         0          3 |     Total
-----------+----------------------+----------
         0 |     7,164      1,860 |     9,024 
         1 |       807        651 |     1,458 
         2 |       440        248 |       688 
         3 |     3,143      3,758 |     6,901 
-----------+----------------------+----------
     Total |    11,554      6,517 |    18,071 


. 
. //AME of MNL
. quietly mlogit phi age2039 age4064 age6579 age80 Australia /*
> */English male married condno excelh verygood good fair degree dipcert /*
> */income4 income5 income6 income7 income8 income9 income10 workft workpt unemp

. margins, dydx(*) predict(outcome(0)) post

Average marginal effects                        Number of obs     =     18,071
Model VCE    : OIM

Expression   : Pr(phi==0), predict(outcome(0))
dy/dx w.r.t. : age2039 age4064 age6579 age80 Australia English male married condnoc
               excelh verygood good fair degree dipcert income4 income5 income6
               income7 income8 income9 income10 workft workpt unemp

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age2039 |   .2907167   .0145654    19.96   0.000     .2621689    .3192644
     age4064 |    .146746   .0150602     9.74   0.000     .1172285    .1762634
     age6579 |   .1024215   .0172917     5.92   0.000     .0685303    .1363127
       age80 |   .1710516   .0232052     7.37   0.000     .1255702    .2165329
   Australia |  -.0759317   .0102776    -7.39   0.000    -.0960755    -.055788
     English |  -.0210992   .0138189    -1.53   0.127    -.0481838    .0059854
        male |   .0657894   .0074532     8.83   0.000     .0511814    .0803975
     married |  -.1569307   .0070256   -22.34   0.000    -.1707005   -.1431608
     condnoc |  -.0201868   .0024216    -8.34   0.000     -.024933   -.0154405
      excelh |  -.2210414   .0188702   -11.71   0.000    -.2580262   -.1840566
    verygood |   -.176264   .0178928    -9.85   0.000    -.2113332   -.1411947
        good |  -.1326865   .0177724    -7.47   0.000    -.1675199   -.0978532
        fair |  -.0616394   .0189905    -3.25   0.001    -.0988601   -.0244188
      degree |  -.1708922   .0107315   -15.92   0.000    -.1919256   -.1498589
     dipcert |  -.0308564     .00807    -3.82   0.000    -.0466734   -.0150394
     income4 |   .0457993   .0125187     3.66   0.000     .0212631    .0703354
     income5 |  -.0076872   .0130119    -0.59   0.555      -.03319    .0178156
     income6 |  -.0096081   .0142159    -0.68   0.499    -.0374707    .0182546
     income7 |  -.0303934   .0155872    -1.95   0.051    -.0609438     .000157
     income8 |  -.0995449   .0151297    -6.58   0.000    -.1291986   -.0698913
     income9 |   -.174921   .0149373   -11.71   0.000    -.2041975   -.1456445
    income10 |   -.313225   .0179577   -17.44   0.000    -.3484214   -.2780286
      workft |  -.0793526   .0120701    -6.57   0.000    -.1030097   -.0556955
      workpt |  -.0894587   .0109593    -8.16   0.000    -.1109386   -.0679788
       unemp |   .1285547   .0245681     5.23   0.000     .0804021    .1767072
------------------------------------------------------------------------------

. quietly mlogit phi age2039 age4064 age6579 age80 Australia /*
> */English male married condno excelh verygood good fair degree dipcert /*
> */income4 income5 income6 income7 income8 income9 income10 workft workpt unemp

. margins, dydx(*) predict(outcome(1)) post

Average marginal effects                        Number of obs     =     18,071
Model VCE    : OIM

Expression   : Pr(phi==1), predict(outcome(1))
dy/dx w.r.t. : age2039 age4064 age6579 age80 Australia English male married condnoc
               excelh verygood good fair degree dipcert income4 income5 income6
               income7 income8 income9 income10 workft workpt unemp

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age2039 |  -.0271218   .0101872    -2.66   0.008    -.0470883   -.0071553
     age4064 |   .0159873   .0100262     1.59   0.111    -.0036637    .0356383
     age6579 |   .0472742    .010903     4.34   0.000     .0259048    .0686436
       age80 |   .0753195   .0124435     6.05   0.000     .0509308    .0997082
   Australia |   -.003991   .0057817    -0.69   0.490     -.015323     .007341
     English |  -.0206681   .0080845    -2.56   0.011    -.0365135   -.0048228
        male |  -.0106254   .0044423    -2.39   0.017     -.019332   -.0019187
     married |   .0217529   .0042938     5.07   0.000     .0133371    .0301686
     condnoc |  -.0001996   .0014419    -0.14   0.890    -.0030255    .0026264
      excelh |   .0416428   .0118602     3.51   0.000     .0183971    .0648884
    verygood |   .0311794   .0113648     2.74   0.006     .0089047     .053454
        good |   .0238222   .0113146     2.11   0.035     .0016461    .0459983
        fair |   .0176236   .0120377     1.46   0.143    -.0059698     .041217
      degree |   .0259397   .0057922     4.48   0.000     .0145872    .0372922
     dipcert |  -.0033496   .0049631    -0.67   0.500     -.013077    .0063778
     income4 |   .0005831   .0074039     0.08   0.937    -.0139282    .0150945
     income5 |  -.0087289   .0081922    -1.07   0.287    -.0247853    .0073274
     income6 |  -.0012592   .0087909    -0.14   0.886     -.018489    .0159706
     income7 |  -.0028191   .0097599    -0.29   0.773    -.0219481      .01631
     income8 |   .0006046   .0091429     0.07   0.947    -.0173152    .0185245
     income9 |    .015699   .0084541     1.86   0.063    -.0008706    .0322686
    income10 |   .0354525   .0089626     3.96   0.000     .0178862    .0530188
      workft |   .0032878   .0073294     0.45   0.654    -.0110775    .0176532
      workpt |   .0009383   .0067619     0.14   0.890    -.0123148    .0141914
       unemp |   -.048897   .0205787    -2.38   0.017    -.0892305   -.0085635
------------------------------------------------------------------------------

. quietly mlogit phi age2039 age4064 age6579 age80 Australia /*
> */English male married condno excelh verygood good fair degree dipcert /*
> */income4 income5 income6 income7 income8 income9 income10 workft workpt unemp

. margins, dydx(*) predict(outcome(2)) post

Average marginal effects                        Number of obs     =     18,071
Model VCE    : OIM

Expression   : Pr(phi==2), predict(outcome(2))
dy/dx w.r.t. : age2039 age4064 age6579 age80 Australia English male married condnoc
               excelh verygood good fair degree dipcert income4 income5 income6
               income7 income8 income9 income10 workft workpt unemp

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age2039 |   -.009634   .0059739    -1.61   0.107    -.0213427    .0020746
     age4064 |  -.0099899   .0061538    -1.62   0.105     -.022051    .0020713
     age6579 |   -.021509   .0075268    -2.86   0.004    -.0362612   -.0067568
       age80 |  -.0847292   .0194371    -4.36   0.000    -.1228252   -.0466331
   Australia |  -.0064692   .0041779    -1.55   0.122    -.0146578    .0017194
     English |    .007649   .0052893     1.45   0.148    -.0027179    .0180159
        male |  -.0072356   .0031352    -2.31   0.021    -.0133805   -.0010908
     married |   .0066348   .0030234     2.19   0.028     .0007091    .0125604
     condnoc |   .0014208   .0009791     1.45   0.147    -.0004982    .0033397
      excelh |   .0137291   .0094451     1.45   0.146     -.004783    .0322412
    verygood |    .012884   .0091255     1.41   0.158    -.0050016    .0307696
        good |   .0173092   .0090575     1.91   0.056    -.0004433    .0350616
        fair |    .017474   .0094761     1.84   0.065    -.0010988    .0360468
      degree |  -.0029095   .0045172    -0.64   0.520     -.011763     .005944
     dipcert |   .0045054    .003288     1.37   0.171    -.0019391    .0109499
     income4 |  -.0046509   .0056338    -0.83   0.409     -.015693    .0063911
     income5 |    .003434   .0052191     0.66   0.511    -.0067954    .0136633
     income6 |   .0009984   .0056703     0.18   0.860    -.0101153    .0121121
     income7 |   .0076134   .0058617     1.30   0.194    -.0038752    .0191021
     income8 |  -.0027387    .006137    -0.45   0.655     -.014767    .0092895
     income9 |  -.0045848   .0060885    -0.75   0.451     -.016518    .0073484
    income10 |  -.0161743   .0077659    -2.08   0.037    -.0313952   -.0009534
      workft |   .0105216   .0049282     2.13   0.033     .0008625    .0201806
      workpt |   .0083762   .0044996     1.86   0.063    -.0004429    .0171953
       unemp |   .0073039   .0091964     0.79   0.427    -.0107208    .0253286
------------------------------------------------------------------------------

. quietly mlogit phi age2039 age4064 age6579 age80 Australia /*
> */English male married condno excelh verygood good fair degree dipcert /*
> */income4 income5 income6 income7 income8 income9 income10 workft workpt unemp

. margins, dydx(*) predict(outcome(3)) post

Average marginal effects                        Number of obs     =     18,071
Model VCE    : OIM

Expression   : Pr(phi==3), predict(outcome(3))
dy/dx w.r.t. : age2039 age4064 age6579 age80 Australia English male married condnoc
               excelh verygood good fair degree dipcert income4 income5 income6
               income7 income8 income9 income10 workft workpt unemp

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     age2039 |  -.2539608   .0147333   -17.24   0.000    -.2828375   -.2250841
     age4064 |  -.1527434   .0149955   -10.19   0.000    -.1821342   -.1233527
     age6579 |  -.1281867      .0173    -7.41   0.000    -.1620941   -.0942794
       age80 |  -.1616419   .0233092    -6.93   0.000    -.2073271   -.1159568
   Australia |   .0863919   .0104199     8.29   0.000     .0659692    .1068146
     English |   .0341183   .0138878     2.46   0.014     .0068988    .0613379
        male |  -.0479284   .0074076    -6.47   0.000    -.0624471   -.0334097
     married |    .128543   .0070898    18.13   0.000     .1146473    .1424387
     condnoc |   .0189656   .0023733     7.99   0.000     .0143141     .023617
      excelh |   .1656695   .0199337     8.31   0.000     .1266002    .2047388
    verygood |   .1322006   .0191015     6.92   0.000     .0947624    .1696388
        good |   .0915552   .0190488     4.81   0.000     .0542202    .1288902
        fair |   .0265418   .0204483     1.30   0.194    -.0135362    .0666198
      degree |    .147862   .0100409    14.73   0.000     .1281823    .1675418
     dipcert |   .0297006   .0080874     3.67   0.000     .0138495    .0455516
     income4 |  -.0417315   .0130795    -3.19   0.001    -.0673669   -.0160961
     income5 |   .0129822   .0131471     0.99   0.323    -.0127857    .0387501
     income6 |   .0098689   .0142889     0.69   0.490    -.0181368    .0378745
     income7 |    .025599   .0155232     1.65   0.099    -.0048258    .0560239
     income8 |    .101679    .014581     6.97   0.000     .0731008    .1302572
     income9 |   .1638068   .0140809    11.63   0.000     .1362087    .1914049
    income10 |   .2939468   .0158903    18.50   0.000     .2628024    .3250911
      workft |   .0655432    .012033     5.45   0.000     .0419589    .0891275
      workpt |   .0801442   .0109379     7.33   0.000     .0587062    .1015821
       unemp |  -.0869615   .0269062    -3.23   0.001    -.1396968   -.0342263
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************
. ******************Second question*************************
. *********************************************************
. 
. 
. tab oralq4cb //check the dependent variable for second question

     Number of |
         times |
     consulted |
    dentist or |
        dental |
  professional |      Freq.     Percent        Cum.
---------------+-----------------------------------
Not applicable |     20,646       93.85       93.85
             1 |      1,148        5.22       99.06
     2 or more |        206        0.94      100.00
---------------+-----------------------------------
         Total |     22,000      100.00

. //create dummy variable as dependent variable
. gen dvisit=0

. replace dvisit=1 if oralq4cb==1
(1,148 real changes made)

. replace dvisit=1 if oralq4cb==2
(206 real changes made)

. tab healinq1 //check the treatment variable 

    Whether currently covered by |
        private health insurance |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
                  Not applicable |      3,771       17.14       17.14
   With private health insurance |      9,131       41.50       58.65
Without private health insurance |      9,024       41.02       99.66
                       Not known |         74        0.34      100.00
---------------------------------+-----------------------------------
                           Total |     22,000      100.00

. //create dummy variable for treatment 
. gen treat=0 if  healinq1==2
(12,976 missing values generated)

. replace treat=1 if  healinq1==1
(9,131 real changes made)

. 
. //create dummy for smoking
. tab smkreglr

                  Regular smoker status |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                         Not applicable |      4,893       22.24       22.24
      Current regular (ie daily) smoker |      3,721       16.91       39.15
Current smoker, not regular (less than  |        311        1.41       40.57
                    Ex (regular) smoker |      4,664       21.20       61.77
 Not current and never smoked regularly |      8,411       38.23      100.00
----------------------------------------+-----------------------------------
                                  Total |     22,000      100.00

. gen nonsmoke=0  //(ref.level)

. gen exsmoke=0

. gen currentsmk=0

. gen regularsmk=0

. replace nonsmoke=1 if smkreglr==4
(8,411 real changes made)

. replace exsmoke=1 if smkreglr==3
(4,664 real changes made)

. replace currentsmk=1 if smkreglr==2
(311 real changes made)

. replace regularsmk=1 if smkreglr==1
(3,721 real changes made)

. //create dummy for drinking 
. tab al2k7day

 Alcohol risk level 7 day average (2000 |
                            guidelines) |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                         Not applicable |      4,893       22.24       22.24
                               Low risk |      8,329       37.86       60.10
                            Medium risk |      1,361        6.19       66.29
                              High risk |        942        4.28       70.57
Last consumed alcohol 1 week to less th |      3,632       16.51       87.08
Last consumed alcohol 12 months or more |      1,227        5.58       92.65
                 Never consumed alcohol |      1,387        6.30       98.96
Time since last consumed alcohol not kn |        229        1.04      100.00
----------------------------------------+-----------------------------------
                                  Total |     22,000      100.00

. gen low=0 //(ref.level)

. gen medium=0

. gen high=0

. replace low=1 if al2k7day==1
(8,329 real changes made)

. replace low=1 if al2k7day==5
(1,227 real changes made)

. replace low=1 if al2k7day==6
(1,387 real changes made)

. replace medium=1 if al2k7day==2
(1,361 real changes made)

. replace high=1 if al2k7day==4
(3,632 real changes made)

. //create "times visited GP" variable
. tab docq2cb

     Number of |
         times |
     consulted |
       general |
  practitioner |      Freq.     Percent        Cum.
---------------+-----------------------------------
Not applicable |     17,469       79.40       79.40
             1 |      3,746       17.03       96.43
             2 |        610        2.77       99.20
     3 or more |        175        0.80      100.00
---------------+-----------------------------------
         Total |     22,000      100.00

. gen gpvisit=docq2cb

. biprobit (dvisit = age2039 age4064 age6579 age80 Australia /*
> */English male married condno excelh verygood good fair degree dipcert /*
> */income4 income5 income6 income7 income8 income9 income10 workft workpt unemp/*
> */ exsmoke currentsmk regularsmk medium low treat) (treat = age2039 age4064/* 
> */ age6579 age80 Australia gpvisit /*
> */English male married condno excelh verygood good fair degree dipcert /*
> */income4 income5 income6 income7 income8 income9 income10 workft workpt unemp)

Fitting comparison equation 1:

Iteration 0:   log likelihood = -4022.8514  
Iteration 1:   log likelihood = -3941.7004  
Iteration 2:   log likelihood = -3940.9043  
Iteration 3:   log likelihood = -3940.9042  

Fitting comparison equation 2:

Iteration 0:   log likelihood = -12583.772  
Iteration 1:   log likelihood = -11093.643  
Iteration 2:   log likelihood =  -11090.07  
Iteration 3:   log likelihood = -11090.069  
Iteration 4:   log likelihood = -11090.069  

Comparison:    log likelihood = -15030.973

Fitting full model:

Iteration 0:   log likelihood = -15030.973  
Iteration 1:   log likelihood = -15030.851  
Iteration 2:   log likelihood = -15030.789  
Iteration 3:   log likelihood = -15030.785  
Iteration 4:   log likelihood = -15030.785  

Seemingly unrelated bivariate probit            Number of obs     =     18,155
                                                Wald chi2(57)     =    2759.84
Log likelihood = -15030.785                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
dvisit       |
     age2039 |  -.1787297   .1374583    -1.30   0.194     -.448143    .0906836
     age4064 |  -.1746018   .0946888    -1.84   0.065    -.3601884    .0109848
     age6579 |  -.2388461   .0929165    -2.57   0.010     -.420959   -.0567331
       age80 |  -.4073322   .1240421    -3.28   0.001    -.6504503   -.1642141
   Australia |  -.1047521   .0521137    -2.01   0.044    -.2068931   -.0026111
     English |   .0235134   .0589391     0.40   0.690     -.092005    .1390318
        male |  -.0927398   .0432656    -2.14   0.032    -.1775388   -.0079409
     married |   -.003127   .0714216    -0.04   0.965    -.1431109    .1368568
     condnoc |   .0279958   .0139386     2.01   0.045     .0006767    .0553149
      excelh |   .0394833   .1235161     0.32   0.749    -.2026039    .2815705
    verygood |  -.0090491   .1075218    -0.08   0.933    -.2197879    .2016897
        good |   .0198396   .0952932     0.21   0.835    -.1669316    .2066108
        fair |   .0500811   .0868449     0.58   0.564    -.1201318    .2202939
      degree |    .049805   .0827407     0.60   0.547    -.1123637    .2119738
     dipcert |   .0113658   .0391591     0.29   0.772    -.0653847    .0881163
     income4 |  -.0622382   .0606894    -1.03   0.305    -.1811873    .0567108
     income5 |  -.0174285   .0588112    -0.30   0.767    -.1326963    .0978393
     income6 |   .0126751   .0642445     0.20   0.844    -.1132418     .138592
     income7 |   .0035877   .0726044     0.05   0.961    -.1387144    .1458898
     income8 |  -.0629905   .0806725    -0.78   0.435    -.2211057    .0951247
     income9 |    .017953   .0987459     0.18   0.856    -.1755855    .2114914
    income10 |  -.0079315    .141398    -0.06   0.955    -.2850664    .2692034
      workft |  -.1329734   .0607221    -2.19   0.029    -.2519865   -.0139603
      workpt |  -.0574515   .0601449    -0.96   0.339    -.1753334    .0604304
       unemp |    .060567   .1031924     0.59   0.557    -.1416863    .2628203
     exsmoke |     .07141   .0374069     1.91   0.056    -.0019061    .1447261
  currentsmk |   .2349429   .1071114     2.19   0.028     .0250085    .4448773
  regularsmk |  -.0374216   .0453455    -0.83   0.409    -.1262971    .0514538
      medium |   .0619386   .0607026     1.02   0.308    -.0570363    .1809135
         low |   -.013692   .0352708    -0.39   0.698    -.0828216    .0554376
       treat |   .4846732    .395352     1.23   0.220    -.2902024    1.259549
       _cons |  -1.575335    .118467   -13.30   0.000    -1.807526   -1.343144
-------------+----------------------------------------------------------------
treat        |
     age2039 |  -.8201785   .0428231   -19.15   0.000    -.9041103   -.7362468
     age4064 |  -.4245842   .0435203    -9.76   0.000    -.5098824   -.3392861
     age6579 |  -.2918733   .0498602    -5.85   0.000    -.3895975   -.1941492
       age80 |  -.3941055   .0618139    -6.38   0.000    -.5152584   -.2729526
   Australia |    .201472   .0292184     6.90   0.000      .144205    .2587389
     gpvisit |  -.0106151   .0190736    -0.56   0.578    -.0479987    .0267686
     English |   .0490048   .0393112     1.25   0.213    -.0280438    .1260533
        male |  -.1788568   .0214514    -8.34   0.000    -.2209008   -.1368127
     married |   .4401503    .021071    20.89   0.000      .398852    .4814487
     condnoc |   .0587572   .0070172     8.37   0.000     .0450038    .0725107
      excelh |   .6278044   .0542996    11.56   0.000     .5213791    .7342298
    verygood |   .5022048   .0512632     9.80   0.000     .4017307    .6026789
        good |   .3739417   .0505761     7.39   0.000     .2748144     .473069
        fair |   .1676959   .0536015     3.13   0.002     .0626388    .2727529
      degree |   .4867252   .0309789    15.71   0.000     .4260077    .5474427
     dipcert |   .0877716   .0232667     3.77   0.000     .0421698    .1333734
     income4 |  -.1322306    .035885    -3.68   0.000    -.2025639   -.0618973
     income5 |   .0162145   .0374918     0.43   0.665     -.057268     .089697
     income6 |   .0185242   .0409766     0.45   0.651    -.0617884    .0988369
     income7 |   .0770918   .0448306     1.72   0.086    -.0107746    .1649582
     income8 |    .277717   .0437979     6.34   0.000     .1918747    .3635593
     income9 |   .4945542   .0430207    11.50   0.000     .4102352    .5788731
    income10 |   .8981071   .0501178    17.92   0.000     .7998781    .9963362
      workft |   .2265393   .0348702     6.50   0.000     .1581949    .2948836
      workpt |   .2608896   .0318353     8.19   0.000     .1984936    .3232857
       unemp |  -.3538998   .0669351    -5.29   0.000    -.4850901   -.2227095
       _cons |  -.7414732   .0678978   -10.92   0.000    -.8745505   -.6083959
-------------+----------------------------------------------------------------
     /athrho |  -.1582287   .2479193    -0.64   0.523    -.6441417    .3276842
-------------+----------------------------------------------------------------
         rho |  -.1569213   .2418145                      -.567713    .3164384
------------------------------------------------------------------------------
Likelihood-ratio test of rho=0:     chi2(1) =  .374512    Prob > chi2 = 0.5406

. ///margins, dydx(treat) predict(pmarg1)
> 
. log close
      name:  <unnamed>
       log:  /Users/stanza/Downloads/Assignment.log
  log type:  text
 closed on:  30 May 2018, 03:29:08
----------------------------------------------------------------------------------------
